#!/usr/bin/env python3

"""
1. Написати джобу, яка витягує всі данні продаж з API та зберігає їх в raw директорію:
* В якості шаблону для джоби використати код в папці: [link]
* API доступна за адресою: https://fake-api-vycpfa6oca-uc.a.run.app/
* Секретний токен до API: 2b8d97ce57d401abd89f45b0079d8790edd940e6
* Приклад, як діставати дані з API: [link]
* Секретний токен в жодному разі не можна зберігати в коді,
    він обовʼязково має зберігатися у змінній середовища з назвою AUTH_TOKEN
* В файлі main.py має бути реалізований WEB сервер за допомогою фреймворка Flask,
    який працює локально і приймає команди у вигляді POST запитів на порт 8081
* Сервер має приймати JSON обʼєкт наступного вигляду: [link]
* Шлях зберігання має мати вигляд: /path/to/my_dir/raw/sales/2022-08-09. 
    Цей шлях має подаватися у вигляді параметру raw_dir для джоби.
* Джоба обовʼязково має бути ідемпотентною. Для цього джоба сама має очищати 
    вміст директорії raw_dir перед записом нових файлів
* Кожну “сторінку” з API можна зберігати в окремому файлі, або всі сторінки в одному великому JSON.
    Файл має мати імʼя sales_2022-08-09.json або sales_2022-08-09_1.json, sales_2022-08-09_2.json
    і т.д. якщо файлів декілька
"""

import requests

headers = {"Authorization": "2b8d97ce57d401abd89f45b0079d8790edd940e6"}
api_url = "https://fake-api-vycpfa6oca-uc.a.run.app/"
data = requests.get(api_url+"sales?date=2022-08-09&page=1", headers=headers)
